Autodesk.Revit.DB.Electrical.CableTrayRun
This class represents a cable tray run in Autodesk Revit.
Remarks:
This class is mainly for calculating length of a cable tray run.
A cable tray run contains connected straight cable tray segments and bends between the straight segments with same type and size.